{
  "main": {
    "name": "Ben Arnold",
    "occupation": "Software Engineer",
    "description": "clean code craftsman, team player, and a work in progress",
    "image": "profilepic.jpg",
    "bio": "I am a clean code craftsman. I take pride in my work because how I write code matters. It matters to the developers that I work with today and to the developers that come after me. It matters to the user and the business. I am a team player. Team players know how to disagree but commit to being held accountable for team decisions. They know how to give and receive feedback with finesse and an open mind. A team player asks, 'How do I provide the greatest possible amount of value to the team?' then they follow through. I am a work in progress. The keyword here is work. It takes work to grow and the process isn't always comfortable. I lean into the discomfort. A better version of myself is formed through the striving. Every sword must be tempered in the fire. 'You should never sacrifice what you could be for what you are.' - Jordan Peterson ",
    "contactmessage": "Hey! Feel free to reach out with any questions you might have and I'll be sure to get back to you.",
    "email": "brawebdev@gmail.com",
    "phone": "317-672-8880",
    "address": {
      "street": "(Your Street)",
      "city": "Fishers",
      "state": "Indiana",
      "zip": "46038"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload": "Resume.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/benjamin-arnold",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/brawebdev",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here you can create a short write-up of your skills to show off to employers",
    "work": [
      {
        "company": "Knowledge Services",
        "title": "Software Engineer",
        "years": "10/2017 - Present",
        "description": "Created API endpoints for integration with e-procurement systems, implemented Azure blob storage for cxml input, led technical book club (Books with Ben), setup Automated UI tests with Selenium, established coding standards and integrated with Resharper, Reduced total CSS lines by over 50% while maintaining UI integrity, wrote Fluent Validation input validators with unit tests, etc."
      },
      {
        "company": "Aerodyn Engineering",
        "title": "Instrumentation Technician",
        "years": "10/2014 - 06/2017",
        "description": "Installed and maintained telemetry systems independently and internationally and maintained and improved relations with customers (NASA, Rolls Royce, GE, etc.)"
      },
      {
        "company": "U.S. Marine Corps",
        "title": "Crew Chief",
        "years": "07/2009 - 06/2014",
        "description": "Worked closely with high ranking foreign and U.S. officials and performed safety inspections on multimillion-dollar aircraft "
      }
    ],
    "skills": [
      {
        "name": "C#",
        "level": "75%"
      },
      {
        "name": "SQL",
        "level": "50%"
      },
      {
        "name": "ReactJs",
        "level": "50%"
      },
      {
        "name": "CSS",
        "level": "80%"
      },
      {
        "name": "HTML5",
        "level": "80%"
      },
      {
        "name": "Git",
        "level": "80%"
      },
      {
        "name": "Agile",
        "level": "90%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Canadian Wanderlust",
        "category":"My Travel Blog for my post-university travels",
        "image":"canadian-wanderlust.jpg",
        "url":"https://www.canadianwanderlust.com"
      },
      {
        "title":"Fury Fighting Gear",
        "category":"(offline now) A fighting gear company I started",
        "image":"fury-fighting-gear.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Original Thai Food",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"original-thai-food.jpg",
        "url":"http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title":"Resume Website",
        "category":"A React based resume website template",
        "image":"resume-website.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Smirkspace",
        "category":"(MVP Only) A React and Meteor based chat University project.",
        "image":"smirkspace.jpg",
        "url":"http://www.smirkspace.com"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user":"Kareem Abdul Jabbar"
      },
      {
        "text":"That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user":"Steve Wozniak... impersonator"
      }
    ]
  }
}
